import openpyxl
import re
import numpy as np
def Dataset_load(PATH,SHEET):
    wb = openpyxl.load_workbook(PATH)
    sheet = wb[SHEET]
    a =[]
    for cell in sheet["D"]:
        a.append(cell.value)
    a.pop(0)
    print(len(a))
    a.pop(-1)
    # print(a)
    return a

# def Regular_load(PATH):
#     with open(PATH, "r", encoding="UTF-8") as f:
#         data = f.readlines()
#         print(data)

def re_match(sentence_list,regular_list):
    err_list1 = []
    err_list2 = []
    for sentence in sentence_list:
        num = 0
        sent_reg = []
        sent_reg.append(sentence)
        for regular in regular_list:

            result = re.search(regular, sentence)


            if result:
                num +=1
                sent_reg.append(regular)

        if num ==0:

            err_list1.append(sentence)
        if num >1:

            err_list2.append(sent_reg)
    print("无法匹配的阻断提示内容：",err_list1)
    print("无法匹配的数目：",len(err_list1))
    print("被多次匹配的阻断提示内容：",err_list2)
    print("多次匹配的数目：",len(err_list2))


def re_all_regular(sent_list,all_reg_dic):
    list2 = []
    list3 = []
    for sent in sent_list:
        num2 = 0
        rep_list = []
        list1 = []
        for reg_name,reg_list in all_reg_dic.items():
            num1 = 0
            for reg in reg_list:
                if re.search(reg,sent):
                    num1 +=1
                    list1.append(reg)
            if num1 >=1:
                num2 +=1
                rep_list.append(reg_name)
        if num2 == 0:
            list3.append(sent)

        if num2 >=2:

            print("======================================")

            print(sent,'被',rep_list,'多次匹配')
            list2.append(rep_list)
            print(list1)
    print("没有被匹配", list3,len(list3))
    print(len(list2))
























# 转账提示银行原因异常
yinhang_yichang = ['^交易受限，详情请咨询发卡行$']



# 转账提示申请失败
shenqing_shibai = ['^渠道响应结果为空$']



# ^验证次数超限$
yanzheng_cishu_chaoxian = ['^验证次数超限，请次日重试$']


# 信息异常
xinxiyichang = ["\S+行名填写有误，请核对\S+",
"^户名错误$",
"\S+留存证件有效期已过期\S+",
"\S+客户信息验证失败\S+",
"\S+户名不匹配\S+",
"^实名验证姓名不匹配$",
"^证件号码或类型有误$",
"^账户信息不全$",
"^银行卡未开通认证支付$",
"\S+证件类型和证件号为空\S+",
"^实名认证证件号不匹配$",
"\S+您的证件已过期\S+",
"\S*持卡人身份信息\S*手机号\S*输入不正确\S*",
"\S+未填写付款人开户行名称\S+",
"\S+无该账户信息，请检查输入账户的有效性\S+",
"^信息不匹配$",
"\S+客户名称不一致\S+",
"\S+户名错误\S+",
"\S+您证件已过有效期\S+",
"\S+账户信息无法核实\S+",
"\S+客户姓名错误\S+",
"\S+该账户未通过人民银行账户核实， 请至柜面完成核实\S+",
"\S+卡校验位错误\S+",
"\S+您的证件有效期过期被禁止发起交易\S+",
"\S+未通过E商宝验证交易失败\S+",
"\S+用户姓名输入错误\S+",
"\S*用户名或密码不正确\S+",
"^渠道签名与平台签名不一致$",
"\S*用户名验证不成功\S+",
"\S+您的身份信息不符合监管反洗钱身份识别标准\S+",
"\S+客户信息不符合要求\S+",
"(账号|账户)?\S*(户名|名称)\S*(不符|有误)",
"\S+卡折标志与卡号不符\S+",
"\S+证件号码或姓名与账户不符\S+",
"\S+付款人姓名不符\S+",
"\S+客户信息不全\S+",
"\S+账户已到期，不允许做该交易\S+",
"\S+客户本人证件有效期已过宽限期，不允许出账\S+",
"\S+您在我行的开户证件有效期已过期90天，不允许出账\S+",
"\S*户口不存在\S*",
"\S+卡号不合法,卡号=\S+",
"\S+您预留在我行的证件过期\S+"]



# 转账提示账户状态异常
zhuang_tai = ['\S+本产品未设置此借记卡业务类型参数\S+',
'\S+输入的卡号\S*不存在或者已经销卡\S+',
'\S+不是储蓄帐号\S+',
'\S+不允许持卡人进行的交易\S+',
'\S+不支持该银行存折\S+',
'\S+查询卡号\S+不存在\S+',
'\S+客户账号\S*不存在\S+',
'\S+查询收费账号相关信息异常\S+',
'^出票人已销户$',
'^出票人账户已依法冻结$',
'\S*此卡不支持该业务\S*',
'\S+此账户已?冻结\S+',
'\S+存在“证件到期30天或未留存-只收不付”状态\S+',
'\S+存在银行卡口头挂失状态\S+',
'\S+存折已挂失\S+',
'\S+代收付不支持此行号\S+',
'\S+当前账户为(口头|密码)挂失状态\S+',
'\S+付款人账号状态不正常\S+',
'^该产品不支持该银行卡支付$',
'\S+该卡片已挂失\S+',
'\S+(RJ11-|\[3006\])该卡原已挂失\S+',
'\S+该客户账户被禁止发起交易 请到柜面进行身份核实\S+',
'\S+该账号为信用卡账号,不支持交易\S+',
'\S+该账号暂停客户渠道交易\S+',
'\S+该账户类型不允许做查询和转账交易\S+',
'\S+该账户未通过人民银行账户核实\S+',
'\S+挂失标志不正确\S+',
'\S+过期卡\S+',
'\S+借方卡号不存在\S+',
'\S+借方账号检查错,如有问题请联系您的代理人\S*',
'\S+借记卡已销卡\S+',
'\S+卡\S+锁定\S+',
'^卡关闭$',
'\S+卡号\s\S+\s无效\S+',
'\S+卡号不合法或不存在\S+',
'\S+卡临时挂失\S+',
'^卡号未启用$',
'\S+卡号无效或者卡号不合法\S+',
'\S*卡片未激活\S*',
              '^卡未激活$',
'\S+卡片已销卡\S+',
'\S*卡\S*状态\S*(不正常|错|非正常|异常|为销户)\S*',
'^卡认证失败$',
'\S+卡未发行\S+',
'\S+卡已销户\S+',
'\S+卡有效期已过\S+',
'\S*卡正式挂失\S*',
'\S+客户账号其下没有账号序号\S+',
'\S*客户信息不全，不允许交易\S*',
'\S*客户账户已进行口头挂失\S+',
'\S+\[3059\]密码挂失\S+',
'\S+您的银行卡暂不支持该业务\S+',
'\S+商户状态暂停\S+',
'\S+\[3057\]输入账号非法\S+',
'\S*特殊名单拒绝交易开户６个月内无交易，暂停非柜业务\S+',
'\S+未核实异常账户请至柜面核实身份\S+',
'\S+无此交易权限\S+',
'\S+无此卡号\S+',
'\S+无此帐户\S+',
'\S+无此账户\S+',
'\S+无该卡号信息\S+',
'\S*无效卡号\S*',
'\S+交易为信用卡\(准贷记卡\)交易,不允许进行\S+',
'\S+已挂失卡\S+',
'\S+银行卡未开通认证支付\S+',
'\S+银行无账号\S+',
'\S+帐号不存在或账号状态异常\S+',
'\S+帐号未识别，请确认是否为旧帐号\S+',
'\S+E8201~~帐户已销户\S+',
'\S+[RJ01,RJ01\-,PMRA782]账号不存在\S+',
'\S+账号(错误|有误)\S+',
'\S+账号非法账号\S+',
'\S*账户类型非法\S+',
'\S+账号检查位计算错误\S+',
'\S+账号检查有误\S+',
'\S+账号无效\S+',
'\S+账号校验错误\S+',
'\S+账号已[冻结,挂失,销户]\S+',
'\S+账户\S*不存在\S+',
'\S+账户不支持交易\S+',
'\S+帐户状态异常\S+',
'^不是储蓄帐号!$',
'\S*账户透支\S+',
'\S*账户已[挂失,销户,关户]\S*',
'\S+账户已经销户\S+',
'\S+账户已暂停非柜面交易\S+',
'\S+账户状态错误\S+',
'\S+账户状态为单向冻结\S+',
'\S*账户状态异常\S*',
'\S+主账户下没有这个子帐户\S+',
'\S+主账户已止付\S+',
'^注销的卡$',
'\S+转账失败附卡不能进行此交易\S+',
'\S+转账失败帐户止付\S+',
'\S+账户凭证挂失\S+',
'\S+单向冻结状态不允许支取\S+',
'\S+账户冻结\S+',
"\S+户名有误\S+",
'资金返回失败:银行返回\[999\]：\[000001\]RJ11-商业银行已拒绝,如有问题请联系您的代理人']



# 密码异常
mima_yichang =['\S+密码初始状态不正确\S+',
'\S+密码已锁定\S+',
'\S+密码错,如有问题请联系您的代理人\S*',
'\S+密码已渠道锁定，稍后请柜面重试或进行密码重置\S+',
'^密码已锁定$',
'\S+卡密码丢失，商业银行已拒绝',
'^卡密码丢失$',
'\S+处于新发卡密码待激活状态\S+']




# 余额不足
yue_buzu = [
'\S*可用余额或基金份额不足\S*',
'^账户余额不足$',
'^余额不足$',
'\S+余额不足\S+',
'\S+账号=\S+可用余额=\S+']



# 账户类型错误
zhanghu_leixing_cuowu = ['\S+帐号类型不正确\S+',
'交易类型2账号\S*失败',
'\S+账号类型错误\S+',
'账号不是主账号\S*子账户\S*',
'\S+账户类型有误\S+',
'^账户类型错误$',
'\S+账户类型非法\S+',
'\S+非活期账号\S+',
'\S+对方账号非约定账号\S+',
'^账号属性错误$']


# 没有符合条件的交易记录
meiyou_fuhetiaojian = ['\S+没有符合条件的记录\S+',
'\S*无交易记录::记录不存在$',
                       '^记录不存在\S+',
                       '\S+交易记录不存在::其它错误\S+',
                       '\S+账户\S*记录不存在\S+',
                       '\S+错误描述：账户记录不存在\S+',

'\S+输入的卡号\S+不存在或者已经销卡\S+',
'^查无记录$',
'^交易记录不存在$',
'^无此交易$',
'\S+无此原交易\S+',
'\S+交易不存在\S+',
'\S+不存在交易记录\S+',
'\S+无交易记录\S+',
'\S+不存在该流水号的交易\S+',
'\S+查无记录\S+',
'\S+没有满足条件纪录\S+',
'\S+无此业务数据\S+',
'\S+卡资料不存在\S+',
'\S+没有找到符合条件的定期子账户\S+',
'\S+无此交易,如有问题请联系您的代理人\S*',
'\S+账户或卡号不存在\S+',
'\S+未找到记录\S+',
]


# 交易限额超限
jiaoyi_xiane_chaoxian = ['\S+累计\S*限额\S*超限\S*',
'\S+累计金额超过规定金额\S+',
'\S+二类账户支出限额元件日取值超限\S+',
'\S+累计转出金额超限\S+',
'^超出商户本月交易限额$',
'^交易金额超过用户日累计交易限额$',
'^超出设置限额范围$',
'^超过时限额度限制$',
'^当前连接数超过银行最大连接数量$',
'^分账金额超限$',
'^付款金额超过当月剩余限额$',
'^交易超过该银行的单笔限额$',
'^交易超过该银行的单日累计限额$',
'^认证不一致(不通过):密码错误次数超限$',
'^收费金额超过单笔最大金额第\[1\]笔$',
'\S*超过设置的日限额\S*',
'\S*单日累计笔数超限\S*',
'\S+超出提款限额\S+',
'\S+当日存款超过限额\S+',
'\S+交易金额超过日累计交易限额\S+',
'\S+资源并发数超过限制\S*拒绝当前交易请求\S+',
'\S+单笔交易金额超过单笔金额上限\S+',
'\S+交易金额错误或者超过最大的允许金额\S+',
'\S*您的交易已经超过II类账户付款日限额\S+',
'\S+超过额度限制\S+',
'\S+交易(金额|额度)\S*超限\S+',
'\S+金额超限::金额超限\S+',
'\S+并发数超限\S+',
'\S+密码(校验|错误)次数超限\S*',
'\S+每日二类账户支出限额超限\S+',
'\S*当日单账户成功金额超过日最大单账户成功金额限制\S+',
'\S+交易超过最大允许金额\S+',
'\S+限额超限,如有问题请联系您的代理人\S*',
'\S+超出账号\S+单日限额\S+',
'\S+支付金额超过每日限额\S+',
'\S+代理业务额度超限\S+',
'\S+累计交易金额超过规定金额\S+',
'\S+超过最(大|小)金额限制\S+',
'\S+超出商户单笔限额\S+',
'\S+渠道金额超限\S+',
'\S*超过账户\S+金额限制\S+',
'\S+日累计金额超限\S+',
'\S+超出设置限额范围\S+',
'\S+支出超过限额\S+',
'\S+单笔金额超过上限额度\S+',
'\S*超限额50000.00\S+'
]

# 交易异常
jiaoyi_yichang = ['\S+根据客户序列号找不到对应的凭证，请检查客户序列号是否正确\S+',
'^90-发送失败$',
'\S*因帐户长期不动帐，请到柜台办理业务\S*',
'^E8001::交易失败:A3152357534::其它错误$',
'^E8001::交易失败:未定义的响应码\S+其它错误$',
'^RJ01-商业银行已拒绝$',
'\S+接收BANCS处理错误\S+',
'\S+拒绝访问- 分行账户\S+',
'\S+该账户六个月以上无金融交易发生，请至柜面激活\S+',
'\S+卡产品不允许这种交易\S+',
'\S+\sLINK BANCS ERROR\S+',
'\S+数据库错误Read Scen error\S+',
'\S+Email/手机号/区域号签约关系不存在\S+',
'\S+当前数据未同步，请稍后重试\S+',
'^RJ90-RJ90其他，商业银行已拒绝$',
'\S+根据国家相关法律法规，贷款资金不得用于当\S+',
'\S+行内处理超时\S+',
'^RJ90-其他\( A3A9729\)，商业银行已拒绝$',
'^RJ90-其它原因，商业银行已拒绝$',
'\S*CCPC已拒绝\S*',
'^RJ90-入账未明，商业银行已拒绝$',
'^RJ90-商业银行已拒绝$',
'^RJ90-业务处理失败$',
'^RJ90-帐号非法，商业银行已拒绝$',
'^单笔实时交易处理发生异常$',
'^订单支付失败$',
'^反冲信息：交易失败$',
'^付款银行编码没有对应的数据$',
'^该交易处理中$',
'^该交易存在风险，拒绝验证$',
'^黑名单账户控制$',
'^后台码返回未明,请检查$',
'^获取支付渠道参数失败$',
'^交易超时$',
'^交易失败$',
'^交易失败，请稍后重试$',
'^交易失败，详情请咨询您的发卡行\S+',
'^借方与贷方未签协议第\[1\]笔$',
                  '\S+借方与贷方未签协议第\[1\]笔,如有问题请联系您的代理人$',
'^卡产品不允许这种交易$',
'^名称无效或者名称遗漏$',
'^某单笔必输项有误\S+',
'^批次被撤销$',
'^其他$',
'^生产签报作废$',
'^失败$',
'^输入信息有误$',
'^委托项目编号：110202349,执行终审失败$',
'^无法查询到该交易，可以重发$',
'^选择支付渠道失败$',
'^验证次数超限，请次日重试$',
'^银行扣款失败：该交易处理失败$',
'^银联风险受限$',
'^帐户性质错\S*',
'^账户未开通银联无卡支付业务$',
'^账务处理中，暂不能受理业务$',
'^支付失败$',
'^支付中$',
'^重复交易$',
'^转入新账户出错。$',
'^资金返回: ORA-00001$',
'\S*Could not open Hibernate Session for transaction\S*',
'^资金返回:未设置对应对私参数$',
'\S*生成交易数据异常，请联系您的代理人\S*',
'\S+交易失败::交易失败,如有问题请联系您的代理人\S*',
'\S+币别或钞汇鉴别不存在\S+',
'\S+非工行卡,如有问题请联系您的代理人\S*',
'\S+超时拒付,如有问题请联系您的代理人\S*',
'\S+交易结果不明确，如银行已扣款，则会在三个工作日内退款到客户账户\S+',
'\S+渠道已关闭，交易无法进行\S+',
'\S+缴费协议有误,如有问题请联系您的代理人$',
'\S+日期切换中\S+',
'\S+商户号未登记\S+',
'\S+商户需要在银行或中心登记\S+',
'\S+映射交易流水号出错\S+',
'\S+金额错误,如有问题请联系您的代理人\S*',
'^资金返回失败:银行返回\S+起息日期应小于等于工作日期,如有问题请联系您的代理人',
'\S+指令处理失败::指令处理失败,如有问题请联系您的代理人$',
'\S+指令处理失败::因帐户长期不动帐\S*',
'\S+指令处理失败::其他错误,如有问题请联系您的代理人\S*',
'\S+不确定置失败\S+',
'\S+超时置失败\S+',
'\S*资金返回失败:银行返回\S*交易异常，请稍后再试,如有问题请联系您的代理人S*',
                  '\S*错误原因：交易异常外呼\[\]交易失败\S*',
'\S+接收应答失败\S+',
'\S+扣款失败\S+',
'\S+没有查询到该订单号数据\S+',
'\S+无该项业务\S+',
'\S*该户口已关户,如有问题请联系您的代理人',
'\S+转账失败卡号未启用\S+',
'\S+不能对此类账户做此类交易\S+',
'\S+不能对此类账户作此交易\S+',
'\S+验证签名失败\S+',
'\S+单笔代收付交易处理发生异常\S+',
'\S+映射交易流水号出现异常\S+',
'\S+邮储渠道暂停服务\S+',
'\S+收款人开户行号补录的清算行不存在\S+',
'\S+根据省市行别补录失败\S+',
'\S+企业编码跟费项信息不匹配\S+',
'\S+\[000001\]90-RJ02-,如有问题请联系您的代理人',
'\S+发报行非营业状态\S+',
'\S+\[000001\](90-)?RJ90-其他\( EBP0030\)\S+',
'\S*\[000001\](90-)?RJ90-其他,如有问题请联系您的代理人',
'\S+检查参与机构登录状态未通过\s\S+',
'\S+日终逾期退回\S+',
'\S+结算帐户检查失败\S+',
'\S*\[000001\]RJ01-商业银行已拒绝,如有问题请联系您的代理人\S*',
'\S*\[000001\]RJ03-商业银行已拒绝,如有问题请联系您的代理人\S*',
'\S*\[000001\]RJ03-&7Y\S*商业银行已拒绝,如有问题请联系您的代理人\S*',
'\S*\[000001\]RJ03-,如有问题请联系您的代理人\S*',
'\S+付款合法性检查失败\S+',
'\S+REPOSTING.TRY LATER\S+',
'\S+\[000001\]RJ90\S+卡关闭\S+',
'\S+支取本金>实际金额\S+',
'\S+账户因涉案暂停非柜面业务\S+',
'\S+卡公用档记录不存在\S+',
'\S+\[000001\]RJ90-其他，商业银行已拒绝\S+',
'\S+\[000001\]RJ90-其它原因\S+',
'\S+\[000001\]RJ90-入账未明\S+',
'\S+\[000001\]RJ90-业务发送失败\S+',
'\S+检查参与机构登录状态未通过\S+',
'\S+\[000001\]-其他,如有问题请联系您的代理人$',
'\S+中心处理失败\S+',
'\S+商户提交的交易数据有误\S+',
'\S+\[11\]失败,如有问题请联系您的代理人$',
'\S+\[2005\]发送异常,失败\S+',
'\S+\[2007\]超时,如有问题请联系您的代理人$',
'^发卡行交易权限受限$',
'\S+交易失败详情请咨询您的发卡行\S+',
'\S+超出交易金额限制\S+',
'\S+\[3018\]已清户,如有问题请联系您的代理人\S*',
'\S+\[3028\]\(1808\)凭证不存在\S+',
'\S+\[3038\]此帐号不通兑\S+',
'\S+\[3038\]非通兑户\S+',
'\S+\[3052\]找不到原业务\S+',
'\S+\[3057\]主机拒绝:主机拒绝\S+',
'\S+\[3057\]注销状态不正确\S+',
'\S+\[3071\]商户未映射',
'\S+\[3999\]\[93012588\]指令处理失败\S+',
'\S+CommunicateWithEBank Trcode=210237, SepcialFlag=0\S+',
'\S+\[3999\]EBLN5000交易处理失败\S+',
'\S+\[3999\]MAC校验失败\S+',
'\S+\[3999\]P6分行升级\S+',
'\S+\[3999\]白名单检查不通过\S+',
'\S+[3999]报文加密失败\S+',
'\S+\[3999\]超时\S+',
'\S+接出CA请求失败\S+',
'\S+外呼\S+不成功，错误码\S*错误描述：@@接出CA请求失败\S*',
'\S+账务交易发生异常错\S+',
'\S+读取活期产品主档对照错误\S+',
'\S+对不起，该分行的该交易已经关闭，请稍候再做\S+',
'\S+发卡行交易权限受限详情请咨询您的发卡行\S+',
'\S+该交易尚未开通\S+',
'\S+\[3999\]该客户账户被禁止发起交易\S+',
'\S+\[3999\]该账户未通过人民银行账户核实\S+',
'\S+合作方编号、商户编号不识别\S+',
'\S+检查反洗钱不通过\S+',
'\S+\[3999\]交易错误,如有问题请联系您的代理人$',
'\S+\[3999\]交易金额tranAmt不能高于maxTranAmt\S+',
'\S+\[3999\]交易失败\S+',
'\S+\[3999\]缴费协议过期\S+',
'\S+\[3999\]缴费协议有误\S+',
'\S+开户地信息查询失败\S+',
'\S+客户未开通该项功能\S+',
'\S+您的账户已被停止非柜面服务请您携带有效证件到我行\S+',
'\S+\[3999\]其他原因失败\S+',
'\S*\[3999\]其他暂未确定错误\S+',
'\S+签名验签失败,交易未签名\S+',
'\S+签名验签失败,证书已过期\S+',
'\S+受托代扣总开关关闭\S+',
'\S+提入机构已签退\S+',
'\S+通过卡号查询机构信息错误\S+',
'\S+协议编号\S+修改本月已用次数及上次修改时间异常\S+',
'\S+已过收费时间\S+',
'\S+\[3999\]银行处理失败\S+',
'\S+\[3999\]银行公司编码未定义\S+',
'\S+银行卡未开通认证支付\S+',
'\S+您的证件已过期或未留存\S+',
'\S+主账户已止付\S+',
'\S+\[C6\]失败,如有问题请联系您的代理人$',
'\S+查无流水,如有问题请联系您的代理人$',
'\S+银行业务不受理\S+',
'\S+交易失败被银行退回/null\S+',
'\S+银行返回\[999\]交易失败\S+',
'^资金实时交易失败$',
# '\S+此时间段不允许发起业务::非受理时间不受理该业务\S+',
'\S+此时间段不允许发起业务\S+',
'\S+该时间段不受理此账户类型\S+',
'\S+接出CA处理响应失败\S+',
'\S+报文加密失败,如有问题请联系您的代理人\S*'
]


# 系统异常
xitong_yichang = ['交易失败+\S*因流量控制而未成功+\S*其它错误',
'\S*PSI通讯错误！跟PSI通讯错误::外部系统通讯失败\S*',
'资金返回失败:银行返回+\S*网络维护中',
'资金返回失败:银行返回+\S*PSI通讯错误',
'资金返回失败:银行返回+\S*与鉴权中心通讯超时',

'资金返回失败:银行返回+\S*(没有符合条件的记录|对外接口调用超时|批交易提交后台失败|接口系统故障|系统异常|调用失败)\S*其它错误',

'资金返回失败:银行返回+\S*交易失败(:B3157592165::|:公司账户请去办理公司业务|:卡户未激活|:日期错误:逻辑集中系统返回|:外系统处于封锁状态)\S*其它错误',

'资金返回失败:银行返回+\S*(发送异常,如有问题请联系您的代理人|入表错误|提交失败|系统超时|通讯故障|银行维护中|银行渠道异常'
                '|系统维护期间|银行资源繁忙|银行资源忙碌|系统存储过程未配置|接收后台超时|添加客户端发送发生异常)\S*',

                  '\S+发送异常，请查询.,如有问题请联系您的代理人$',

'资金返回失败:银行返回:\[999\]通联返回\[3999\]E8001::交易失败:未定义的响应码\[0001\]:B3781980877:B3184592776::其它错误,如有问题请联系您的代理人',

'^接收后台超时$',
'^连接银行失败$',
'^网络超时，请稍后重试$',
'^系统正忙,请稍后再试$',
'^银行或渠道网络异常$',
'^支付渠道系统故障$',
'^处理超时$',
'^年终决算处理中，暂不能受理业务$',
'^连接tcp://172.16.20.78:9055失败$',
'^资金系统返回信息业务处理失败+\S*',
'^资金系统返回信息: null',

'资金返回失败:银行返回+\S*\s*(系统忙|与鉴权中心通讯超时|系统超时|网络异常,发送超时|接收后台超时|系统繁忙|网络异常|应用系统返回错误|系统维护更新中|系统错误|版本升级中|P6系统升级|'
'接入CA内部请求失败|调用GQFS系统的CD8000服务时与外围系统建立连接失败|系统非交易状态|外部系统错误|当前提交数量过多|当前系统状态不允许受理报文|系统维护处理失败|'
'系统升级中|系统关闭|系统处理异常|数据库连接失败|银行系统维护中|系统正在补送该帐户的夜间交易|'
'系统处理异常|连接tcp://172.16.20.78:9055失败|后台主机错误|数据传输阶段发生异常)+\S*',

'资金系统返回信息+\S*\s*(系统超时)+',
'\S*\s*(对外接口调用超时|接口系统故障|数据库错)+\S*\s*其它错误',
'\S*后台系统应用响应\^\^CCBS~~SDB01~~DB NAME=BCMTLRD ,SEQ=02,STATUS=BD.,如有问题请联系您的代理人$',
'\S*\s*系统正在补送该帐户的夜间交易\S*\s*商业银行已拒绝',
'^RJ90-系统停运$',
'^RJ90-支付系统停运拒绝处理$',
'^系统忙，请稍后尝试',
                  '\S*90-后台系统应用响应\S+异常\S*',

                  '\S*资金返回失败:银行返回\[999\]：\[000001\]RJ90-后台系统应用响应\S+(帐户控制状态不允许支取|该卡种不允许转帐|系统升级中，暂无法受理您的交易)\S*',

                  '\S*后台系统应用响应^^CCBS~~SDB01~~DB NAME=BCMTLRD ,SEQ=02,STATUS=BD\S*',
                  '\S*交易失败:接口系统故障:逻辑集中系统返回\S+其它错误',
                  '^RJ90-交易失败，系统繁忙请稍后重试，商业银行已拒绝$',
                  # '\S*E8001::交易失败\S*其它错误,如有问题请联系您的代理人\S*',
                '^资金返回失败:银行返回:\[999\]\[3999\]指令处理失败,如有问题请联系您的代理人$',
                  '资金返回失败:银行返回\[999\]：\[3999\]\[93014034\]指令处理失败,如有问题请联系您的代理人AA',
                  '资金返回失败:银行返回\[999\]：\[3999\]指令处理失败,如有问题请联系您的代理人',
                  '资金返回失败:银行返回\[999\]：\[1002\]无此交易记录,如有问题请联系您的代理人',

                  '\S*E8001::交易失败:(公司账户请去办理公司业务|卡户未激活:逻辑集中系统返回|日期错误|外系统处于封锁状态)\S*其它错误,如有问题请联系您的代理人\S*',
                  # '\S*E8001::交易失败:\S*其它错误,如有问题请联系您的代理人\S*',

                  '资金返回失败:银行返回(:)?\[999\]\S*\[3999\]\S*(逻辑集中系统9938|逻辑集中系统返回:B4'
                  '|逻辑集中系统返回::|该账户已办理凭证临时挂失:逻辑集中系统返回:A3|该账户已止付:逻辑集中系统返回:|接口系统故障:逻辑集中系统返回:|'
                  '日期错误:逻辑集中系统返回:|交易失败:外系统处于封锁状态:逻辑集中系统返回:|其他错误|当前业务未知|交易日期有误|转账失败卡号不在CDT表中'
                  '|交易日期与银行日期不符)\S*其它错误,如有问题请联系您的代理人$',
                    '^资金系统返回信息指令处理中,请稍后查询$',
                  '资金返回失败:银行返回(:)?\[999\]\[3999\]其它错误,如有问题请联系您的代理人',
                  '资金返回失败:银行返回\[999\]：\[3999\]其它错误,如有问题请联系您的代理人'
                  ]



# 转账提示没有业务流水号
meiyou_yewu_liushuihao = ['\S*[未找到,不存在]\S*流水号\S*',
                          '\S*流水号\S*不存在,如有问题请联系您的代理人$']


# 转账提示通讯异常
tongxun_yichang = ['\S*通讯异常\S*']



# 转账提示非受理时间
feishouli_shijian = ['\S*非受理时间不受理该业务\S*']



# 转账提示不能跨省交易

kuasheng_jiaoyi = [
'\S*不能跨省市交易\S*商业银行已拒绝\S*']


all_reg_dic = {'转账提示银行原因异常':yinhang_yichang,'转账提示申请失败':shenqing_shibai,'验证次数超限':yanzheng_cishu_chaoxian,
               '信息异常':xinxiyichang,'转账提示账户状态异常':zhuang_tai,
               '密码异常':mima_yichang,'余额不足':yue_buzu,'账户类型错误':zhanghu_leixing_cuowu,
                '没有符合条件的交易记录':meiyou_fuhetiaojian,'交易限额超限':jiaoyi_xiane_chaoxian,
               '交易异常':jiaoyi_yichang,'转账提示没有业务流水号':meiyou_yewu_liushuihao,'系统异常':xitong_yichang,
               '转账提示通讯异常':tongxun_yichang,'转账提示非受理时间':feishouli_shijian,'转账提示不能跨省交易':kuasheng_jiaoyi}









dataset =Dataset_load("test1.xlsx","Sheet1")


re111 = re_all_regular(dataset,all_reg_dic)
